package ua.lviv.iot.career;

public class CareerPath {

    // клас, який був створений для того, щоб нести інформацію про те,
    // що буду шукати шлях визначення найкращого досвіду для працівника, рухаючись по елементах графу;

    
    public int quantityOfLevels;

    // оголосив поле, що характеризує кількість рівнів на поточному графі;
    
    public int[][] currentOfGraph;

    // оголосив масив значень, які будуть заповнені пізніше із файлу "input.csv";
    
    public CareerPath(int quantityOfLevels, int[][] currentOfGraph) {

        // створив конструктор із параметрами, ідентичний до назви класу, який вказаний вище;
        // передав туди поля, оголошені в класі;

        super();
        // звернення до надкласу;
        // присутня складна ієрархічна структура;

        this.quantityOfLevels = quantityOfLevels;
        this.currentOfGraph = currentOfGraph;

        // завдяки ключовому слову "this" звертаюся до полів, які передані в якості параметрів;
        // прагну, щоб компілятор зрозумів, що хочу використовувати саме ці поля, а не інші;

    }

}
